Revit 2027 API
BuiltInFailures.FamilyFailures.FamilyNotFitHostShape Property
 The host shape has changed and the family is no longer appropriate.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyNotFitHostShape { get; }
Public Shared ReadOnly Property FamilyNotFitHostShape As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyNotFitHostShape {
	FailureDefinitionId^ get ();
}
static member FamilyNotFitHostShape : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace